unicorn-rails-perf.out
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /hello
Document Length:        11 bytes

Concurrency Level:      10
Time taken for tests:   22.945 seconds
Complete requests:      10000
Failed requests:        0
Write errors:           0
Total transferred:      4710000 bytes
HTML transferred:       110000 bytes
Requests per second:    435.83 [#/sec] (mean)
Time per request:       22.945 [ms] (mean)
Time per request:       2.294 [ms] (mean, across all concurrent requests)
Transfer rate:          200.46 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0      41
Processing:     2   23 126.6     13    2019
Waiting:        2   22 126.6     13    2019
Total:          4   23 126.6     14    2019

Percentage of the requests served within a certain time (ms)
  50%     14
  66%     14
  75%     15
  80%     15
  90%     17
  95%     19
  98%     28
  99%     68
 100%   2019 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /v1/json
Document Length:        15 bytes

Concurrency Level:      10
Time taken for tests:   31.466 seconds
Complete requests:      10000
Failed requests:        0
Write errors:           0
Total transferred:      4420000 bytes
Total POSTed:           1600000
HTML transferred:       150000 bytes
Requests per second:    317.80 [#/sec] (mean)
Time per request:       31.466 [ms] (mean)
Time per request:       3.147 [ms] (mean, across all concurrent requests)
Transfer rate:          137.18 [Kbytes/sec] received
                        49.66 kb/s sent
                        186.83 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   14 437.3      0   13846
Processing:     2   17  26.5     14     447
Waiting:        2   16  26.2     14     446
Total:          2   31 437.8     14   13861

Percentage of the requests served within a certain time (ms)
  50%     14
  66%     15
  75%     16
  80%     17
  90%     20
  95%     22
  98%     26
  99%     34
 100%  13861 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /v2/json
Document Length:        48 bytes

Concurrency Level:      10
Time taken for tests:   59.475 seconds
Complete requests:      10000
Failed requests:        0
Write errors:           0
Non-2xx responses:      10000
Total transferred:      3170000 bytes
Total POSTed:           1630000
HTML transferred:       480000 bytes
Requests per second:    168.14 [#/sec] (mean)
Time per request:       59.475 [ms] (mean)
Time per request:       5.947 [ms] (mean, across all concurrent requests)
Transfer rate:          52.05 [Kbytes/sec] received
                        26.76 kb/s sent
                        78.81 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   2.4      0     233
Processing:     5   59  70.1     52    2107
Waiting:        5   59  70.1     52    2107
Total:          8   59  70.1     53    2107

Percentage of the requests served within a certain time (ms)
  50%     53
  66%     55
  75%     57
  80%     58
  90%     63
  95%     71
  98%     88
  99%    199
 100%   2107 (longest request)